"""
1. Среднее
Дано: 3 случайных числа.

Задание: написать программу, которая будет вычислять среднее значение этих чисел.

Пример: (52 + 56 + 60) / 3 = 56
"""
from random import randint


def main():
    x1 = randint(0, 100)
    x2 = randint(0, 100)
    x3 = randint(0, 100)

    print(f"({x1} + {x2} + {x3}) / 3 = {(x1+x2+x3)//3}")


if __name__ == "__main__":
    main()
