"""
[Junior] 4. Число "наоборот"
Дано: целое число (int).

Задание: написать программу, которая будет инвертировать целое число

Пример: 1) x = 123 -> 321 2) x = -325 -> -523 3) x = 0 -> 0
"""


def main():
    num = int(input("Введите целое число: "))

    if num < 0:
        _num = -int(str(-num)[::-1])
        print(f"{num} -> {_num}")
    else:
        _num = int(str(num)[::-1])
        print(f"{num} -> {_num}")


if __name__ == "__main__":
    main()
